/*
 * =============================================================================
 *
 *       Filename:  hal_watchdog.h
 *
 *    Description:  硬件层 看门狗接口
 *
 *        Version:  virsion
 *        Created:  2018-12-12 15:52:30 
 *       Revision:  none
 *
 *         Author:  xubin
 *        Company:  Taichuan
 *
 * =============================================================================
 */
#ifndef _HAL_WATCHDOG_H
#define _HAL_WATCHDOG_H

#ifdef __cplusplus
extern "C" {
#endif  /* __cplusplus */

	/* ---------------------------------------------------------------------------*/
	/**
	 * @brief halWatchDogOpen 打开看门狗
	 */
	/* ---------------------------------------------------------------------------*/
	void halWatchDogOpen(void);
	/* ---------------------------------------------------------------------------*/
	/**
	 * @brief halWatchDogFeed 喂狗,需要时添加
	 */
	/* ---------------------------------------------------------------------------*/
	void halWatchDogFeed(void);
	/* ---------------------------------------------------------------------------*/
	/**
	 * @brief halWatchDogClose 关闭看门狗
	 */
	/* ---------------------------------------------------------------------------*/
	void halWatchDogClose(void);

#ifdef __cplusplus
}
#endif  /* __cplusplus */

#endif
