/************************************************************************************
文件名称：
文件功能：
函数列表：
修改日期：
*************************************************************************************/
#ifndef RK_VOICE_PROINTERFACE_H
#define RK_VOICE_PROINTERFACE_H

/*--------------------------------------- include -----------------------------------*/


#ifdef __cplusplus
extern "C" {
#endif


/*--------------------------------------- 宏定义 -----------------------------------------*/





/*--------------------------------------- 枚举定义 ----------------------------------------*/





/*--------------------------------------- 结构体定义 --------------------------------------*/







/*-------------------------------------- 全局变量声明 --------------------------------------*/






/*----------------------------------------- 函数声明 ---------------------------------------*/
extern short int VOICE_Init(short int *pshwPara);
extern void VOICE_ProcessTx(short int           *pshwIn,
	    short int           *pshwRef,
		short int           *pshwOut,
		int            swFrmLen);
extern void VOICE_ProcessRx(short int           *pshwIn, 
		short int           *pshwOut, 
		int            swFrmLen);
extern void VOICE_Destory();


#ifdef __cplusplus
} 
#endif

#endif
